package ExamplesShildt.Chapter7.Super.OrderOfConstruction;
// Создать суперкласс
public class A {
    A() {
        System.out.println("Конструктор А");
    }
}
