package ExamplesShildt.Chapter7.Super.OrderOfConstruction;
// Создать подкласс путем расширения класса A
public class B extends A {
    B() {
        System.out.println("Конструктор B");
    }
}
