package ExamplesShildt.Chapter7.Super.OrderOfConstruction;
// Создать подкласс путем расширения класса B
public class C extends B {
    C() {
        System.out.println("Конструктор C");
    }
}
